---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNamingIndex
source: html/f7f947d4-1e02-1afa-5b69-74c9511ccf41.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNamingIndex Property

The Circuit Naming Index where the Electrical System is located in its panel.
 The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.

## Syntax (C#)
```csharp
public int CircuitNamingIndex { get; }
```